print("""Привет, мир!
апекврыварыав
врарорчвыпп
рррррро
прап
ппп
пп
п
""")

print("Привет\nЗдо\tрова\nЗ\nд\nр\nа\nв\nс\nт\nв\nу\nй")

print('"Текст в кавычках""')
print("'Текст в апострофах'")
print('"Текст \"в\" кавычках"')

# Конкатенация строк (Склейка)

t = "Привет"
t1 = "миp"
print(t + ' ' + t1 + '...')

tex = "Привет"
tex1 = "миp"
print(tex * 2 + ' ' + tex1 * 4 + '...' * 5)

# Вывод символов из строки
print(t[0])
print(t[1:5])
print(t1[-1])


#Строку в список split
t2 ="Эх мир, куда ты катишься?"

print(t2.split(" "))

#Список в строку join
s= ["К", "Г", "Б"]
print(".".join(s))

#Удаление пробелов в строке

stroka= "      павтр  пр ув ип гно шгдд9  еноке глнг      "
print(stroka.strip())
print(stroka.lstrip())
print(stroka.rstrip())

stroka2="Хей хей хей"
print(stroka2.replace("е","а"))